Revit 2024 API
CircuitNaming Enumeration
 An enumerated type listing all the circuit naming options.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public enum CircuitNaming
Visual Basic
Public Enumeration CircuitNaming
Visual C++
public enum class CircuitNaming
Members
Member name | Description
Undefined |  Circuit naming is Undefined.
Prefixed |  Circuit naming is Prefixed.
Standard |  Circuit naming is Standard.
PanelName |  Circuit naming is Panel Name.
Phase |  Circuit naming is By Phase.
ProjectSetting |  Circuit naming is By Project Setting.
Customized |  Circuit naming is user defined.
See Also
Autodesk.Revit.DB.Electrical Namespace